Tekla.Structures.DirectManipulation.Model.Native.NativeClientHelper
The Tekla.Structures.DirectManipulation.Model.Native.NativeClientHelper class provides a set of helper methods for native clients.

Tekla.Structures.DirectManipulation.Model.Native.NativeClientHelper.GetClientId
Gets the unique client id of current application.
Returns: The client id.